nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [64, 3, 1]]

 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 1, Conv, [128, 3, 1, None, 128, 1]]
 - [-1, 1, Conv, [128, 3, 1, None, 128, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]] # 7

 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 1, Conv, [256, 3, 1, None, 256, 1]]
 - [-1, 1, Conv, [256, 3, 1, None, 256, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 12

 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 1, Conv, [512, 3, 1, None, 512, 1]]
 - [-1, 1, Conv, [512, 3, 1, None, 512, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]] # 17

 - [-1, 1, SPPFCSPF, [512]] # 18

head:
 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 12], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1, None, 256, 1]]
 - [-1, 1, Conv, [256, 3, 1, None, 256, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 25

 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 7], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1, None, 128, 1]]
 - [-1, 1, Conv, [128, 3, 1, None, 128, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]] # 32

 - [-1, 1, nn.MaxPool2d, [2, 2, 0]]
 - [[-1, 25], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1, None, 256, 1]]
 - [-1, 1, Conv, [256, 3, 1, None, 256, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 39

 - [-1, 1, nn.MaxPool2d, [2, 2, 0]]
 - [[-1, 18], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1, None, 512, 1]]
 - [-1, 1, Conv, [512, 3, 1, None, 512, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]] # 46

 - [[32, 39, 46], 1, DetectorTinyv4, [nc]]