nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, C2Tiny, [64, 1, 2]] # 2
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 2, C2Tiny, [128, 1, 2]] # 4
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 2, C2Tiny, [256, 1, 2]] # 6
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 1, C2Tiny, [512, 1, 2]] # 8

 - [-1, 1, SPPFCSPF, [512]] # 9

head:
 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 6], 1, Concat, [1]]
 - [-1, 1, C2Tiny, [256, 1, 2]] # 12

 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 4], 1, Concat, [1]]
 - [-1, 1, C2Tiny, [128, 1, 2]] # 15

 - [-1, 1, Conv, [128, 3, 2]]
 - [[-1, 12], 1, Concat, [1]]
 - [-1, 1, C2Tiny, [256, 1, 2]] # 18

 - [-1, 1, Conv, [256, 3, 2]]
 - [[-1, 9], 1, Concat, [1]]
 - [-1, 1, C2Tiny, [512, 1, 2]] # 21

 - [[15, 18, 21], 1, DetectorTinyv3, [nc]]