nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [64, 3, 1]]

 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-2, 1, Conv, [16, 1, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-5, 1, Conv, [64, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -9], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]] # 13

 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-5, 1, Conv, [128, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -9], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 24

 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-2, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-5, 1, Conv, [256, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [[-1, -9], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]] # 35

 - [-1, 1, SPPFCSPF, [512]] # 36

head:
 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 24], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-5, 1, Conv, [128, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -9], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 49

 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 13], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-2, 1, Conv, [16, 1, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-5, 1, Conv, [64, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -9], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]] # 62

 - [-1, 1, nn.MaxPool2d, [2, 2, 0]]
 - [[-1, 49], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-5, 1, Conv, [128, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -9], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 75

 - [-1, 1, nn.MaxPool2d, [2, 2, 0]]
 - [[-1, 36], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-2, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-5, 1, Conv, [256, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [[-1, -9], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]] # 88

 - [62, 1, Conv, [128, 3, 1]]
 - [75, 1, Conv, [256, 3, 1]]
 - [88, 1, Conv, [512, 3, 1]]

 - [[-3, -2, -1], 1, DetectorTinyv5, [nc]]