nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

backbone:
 - [-1, 1, Conv, [32, 3, 2]]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [64, 3, 1]]

 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-2, 1, Conv, [16, 1, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [[-1, -8], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]] # 12

 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [[-1, -8], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 22

 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-2, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [[-1, -8], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]] # 32

 - [-1, 1, SPPFCSPF, [512]] # 33

head:
 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 22], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [[-1, -8], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 45

 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [[-1, 12], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-2, 1, Conv, [16, 1, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [-1, 1, Conv, [16, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [[-1, -8], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]] # 57

 - [-1, 1, nn.MaxPool2d, [2, 2, 0]]
 - [[-1, 45], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [[-1, -8], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]] # 69

 - [-1, 1, nn.MaxPool2d, [2, 2, 0]]
 - [[-1, 33], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-2, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [[-1, -2, -3, -4, -5], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [[-1, -8], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]] # 81

 - [57, 1, Conv, [128, 3, 1]]
 - [69, 1, Conv, [256, 3, 1]]
 - [81, 1, Conv, [512, 3, 1]]

 - [[-3, -2, -1], 1, DetectorTinyv4, [nc]]