# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
 - [-1, 1, Conv, [32, 3, 2]] # 0 /2
 - [-1, 1, Conv, [64, 3, 2]] # 1 /4

 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Groups, [2, 1, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [-1, 1, Conv, [32, 3, 1]]
 - [[-1, -2], 1, Concat, [1]]
 - [-1, 1, Conv, [64, 1, 1]] # 7
 - [[-6, -1], 1, Concat, [1]]
 - [-1, 1, nn.MaxPool2d, [2, 2, 0]] # 9 /8

 - [-1, 1, Conv, [128, 3, 1]]
 - [-1, 1, Groups, [2, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [[-1, -2], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]] # 15
 - [[-6, -1], 1, Concat, [1]]
 - [-1, 1, nn.MaxPool2d, [2, 2, 0]] # 17 /16

 - [-1, 1, Conv, [256, 3, 1]]
 - [-1, 1, Groups, [2, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -2], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]] # 23
 - [[-6, -1], 1, Concat, [1]]
 - [-1, 1, nn.MaxPool2d, [2, 2, 0]] #25 /32


# YOLOv3-tiny head
head:
  [[-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],  # 28 (P5/32-large)

   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 23], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [256, 3, 1]],  # 32 (P4/16-medium)

   [[32, 28], 1, Detect, [nc]],  # Detect(P4, P5)
  ]
