# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

backbone:
  # [from, number, module, args]
 - [-1, 1, Conv, [32, 3, 1]] # 0
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-2, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [32, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [64, 1, 1]]
 - [[-1, -6], 1, Concat, [1]]
 - [-1, 1, Conv, [64, 1, 1]] # 9

 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-2, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [64, 1, 1]]
 - [-1, 1, Conv, [64, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [64, 1, 1]]
 - [[-1, -9], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]] # 21

 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-2, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [128, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [128, 1, 1]]
 - [[-1, -27], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]] # 51

 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-2, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [256, 1, 1]]
 - [[-1, -27], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 1, 1]] # 81

 - [-1, 1, Conv, [1024, 3, 2]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-2, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [[-1, -3], 1, Shortcut, []]
 - [-1, 1, Conv, [512, 1, 1]]
 - [[-1, -15], 1, Concat, [1]]
 - [-1, 1, Conv, [1024, 1, 1]] # 99

# YOLOv3-tiny head
head:
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [1024, 3, 1]]
 - [-1, 1, Conv, [512, 1, 1]]
 # SPP
 - [-1, 1, nn.MaxPool2d, [5, 1, 2]]
 - [-2, 1, nn.MaxPool2d, [9, 1, 4]]
 - [-3, 1, nn.MaxPool2d, [13, 1, 6]]
 - [[-1, -2, -3, -4], 1, Concat, [1]]
 # END SPP
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [1024, 3, 1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [256, 1, 1]] # 110
 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [81, 1, Conv, [256, 1, 1]]
 - [[-1, -2], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [128, 1, 1]] # 119
 - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
 - [51, 1, Conv, [128, 1, 1]] # 120
 - [[-1, -2], 1, Concat, [1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]]
 - [-1, 1, Conv, [128, 1, 1]]
 - [-1, 1, Conv, [256, 3, 1]] # 128 OUTPUT

 - [-2, 1, Conv, [256, 3, 2]]
 - [[-1, 119], 1, Concat, [1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]]
 - [-1, 1, Conv, [256, 1, 1]]
 - [-1, 1, Conv, [512, 3, 1]] # 136 OUTPUT

 - [-2, 1, Conv, [512, 3, 2]]
 - [[-1, 110], 1, Concat, [1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [1024, 3, 1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [1024, 3, 1]]
 - [-1, 1, Conv, [512, 1, 1]]
 - [-1, 1, Conv, [1024, 3, 1]] # 144 OUTPUT


 - [[128, 136, 144], 1, Detect, [nc]]  # Detect(P4, P5)
